// задать имя терминала:
// управление (шестерёнка снизу слева) -> параметры -> поиск по имени "Terminal › Integrated › Tabs: Title" -> устанавливаем значение ${workspaceFolder}

// Условные выражения
// > - больше
// >= - больше либо равно
// < - меньше
// <= - меньше либо равно
// == - равно
// != - НЕ равно

// && - логическое И (должны выполняться все условия)
// int x = 11;
// if (x > 5 && x < 10)
// {
//     Console.WriteLine("Победа!");
// }
// else
// {
//     Console.WriteLine("Тоже победа, но другая");
// }


// || - логическое ИЛИ (должны выполниться хотя бы одно условие)
// int x = 6;
// if (x == 5 || x > 10)
// {
//     Console.WriteLine("Победа!");
// }
// else
// {
//     Console.WriteLine("Тоже победа, но другая");
// }

// ! - логическое НЕ (если было true станет false и наоборот)
// int x = 2;
// if (!(x > 5))
// {
//     Console.WriteLine("Победа!");
// }
// else
// {
//     Console.WriteLine("Тоже победа, но другая");
// }

// Случайное число
// Диапазон указывается через запятую.
// От первого числа включительно до второго числа НЕ включительно
// int randomNumber = new Random().Next(10, 20); // от 10 до 19 включительно
// Console.WriteLine(randomNumber);

// Операции с числами
// % - остаток от деления
// 4 % 2 == 0
// 5 % 2 == 1
// Console.WriteLine(5 % 2); 

// / - целая часть от деления (для целых чисел) или просто деление (для дробных чисел)
// 4 / 2 == 2
// 5 / 2 == 2
// Console.WriteLine(5 / 2); // 2.5 -> 2


// Напишите программу, которая выводит случайное число
// из отрезка [10, 99] и показывает наибольшую цифру числа.
// 78 -> 8
// 12-> 2
// 85 -> 8

// int number = new Random().Next(10, 100); // от 10 включительно до 100 НЕ включительно
// Console.WriteLine("Случайное число: " + number);
// int first = number / 10; // 45 / 10 == 4
// int second = number % 10; // 45 % 10 == 5
// if (first > second)
// {
//     Console.WriteLine("Наибольшая цифра числа: " + first);
// }
// if (second > first)
// {
//     Console.WriteLine("Наибольшая цифра числа: " + second);
// }
// if (first == second)
// {
//     Console.WriteLine("Цифры числа равны");
// }


// Console.WriteLine(5 / 2); // 5 / 2 -> 2
// Console.WriteLine(5.0 / 2); // 5.0 / 2 -> 2.5
// Console.WriteLine(5 % 2); // 5 % 2 -> 1 
// // 5 - 2 -> 3 - 2 -> 1 (деление - сокращение от вычитания. 
// // при 5 % 2 пытаемся вычесть 2 из 5 до тех пор, пока не будет минимальное целое число)
// Console.WriteLine(5.0 % 2); // 5 % 2 -> 1
// Console.WriteLine(5 % 10); // 5 % 10 -> 5 
// Console.WriteLine(5 / 10);
// (5 нельзя разделить на 10 целое количество раз, поэтому 5 - остаток от деления)