// Напишите цикл, который принимает на вход два числа (A и B) 
// и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// Console.Write("Введите число А = ");
// int numberA = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите число B = ");
// int numberB = Convert.ToInt32(Console.ReadLine());
// int result = numberA;
// if (numberB > 0)
// {
//     for (int i = 1; numberB > i; i++)
//     {
//         result = result*numberA;
//     }

//     Console.WriteLine(result);
// }
// else
// {
//     Console.WriteLine("Ошибка! Число В должно быть натуральным");
// }

int Prompt(string messege)
{
    System.Console.Write(message)
}
